#include <stdio.h>

int main(){
    int A[]={0,49,38,65,97,13,27,49};
    int i,j;

    //最开始子表中存放一个元素，即数组中第一个(不算哨兵)
    for(i = 2 ; i <= 7 ; i++){
        A[0] = A[i];    //将待插元素放置到哨兵位置
        
        //如果插入元素比表尾大进入下一循环，当前元素即变为表尾元素
        if(A[i] < A[i-1]){ 
            //从子表表尾往前扫描，把大于插入元素的元素后移
            //A[0] = A[j]:保证算法稳定性
            for(j = i-1 ; A[0] <= A[j] ; j--){      
                A[j+1] = A[j];
            }
        }
        A[j+1] = A[0];
    }
    
    for(int i = 1; i <= 7 ; i++){
        printf("%d  ",A[i]);
    }
    return 0;
}